# RemoveParameter Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeDefinition..::..RemoveParameter Method
RebarShapeDefinition Class See Also
---
Remove the parameter from the definition.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2009
# Syntax
C#
---
```text
public void RemoveParameter(
	ElementId paramId
)
```

Visual Basic
---
```text
Public Sub RemoveParameter ( _
	paramId As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveParameter(
	ElementId^ paramId
)
```

# ### Parameters
paramId
    Type: Autodesk.Revit.DB..::..ElementId Id of a parameter in the definition.
# Remarks
If the definition does not have the parameter, the method does nothing.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace